---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ComputeRoomVolumeNotCheckedWarn
source: html/c5f51a64-e8c4-3813-728c-d5f954828c57.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ComputeRoomVolumeNotCheckedWarn Property

The setting for calculation of Volume Computations is not on. The analysis model produced will be approximate without the computation of Areas and Volumes

## Syntax (C#)
```csharp
public static FailureDefinitionId ComputeRoomVolumeNotCheckedWarn { get; }
```